1s/ERP/Conf/Enums/ТипыДиаграммПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДиаграммПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Гистограмма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаГоризонтальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаГоризонтальнаяОбъемная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаНормированная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаНормированнаяГоризонтальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаНормированнаяГоризонтальнаяОбъемная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаНормированнаяОбъемная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаОбъемная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаСНакоплением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаСНакоплениемГоризонтальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаСНакоплениемГоризонтальнаяОбъемная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГистограммаСНакоплениемОбъемная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>График</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикПоШагам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикСНакоплением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикСОбластями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикСОбластямиИНакоплением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикСОбластямиНормированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Измерительная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Круговая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыДиаграммПоказателей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует перечень значений - гистограмм
//
// Возвращаемое значение:
//    Массив - перечень значений.
Функция Гистограммы() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Гистограмма);
	Результат.Добавить(ГистограммаГоризонтальная);
	Результат.Добавить(ГистограммаГоризонтальнаяОбъемная);
	Результат.Добавить(ГистограммаНормированная);
	Результат.Добавить(ГистограммаНормированнаяГоризонтальная);
	Результат.Добавить(ГистограммаНормированнаяГоризонтальнаяОбъемная);
	Результат.Добавить(ГистограммаНормированнаяОбъемная);
	Результат.Добавить(ГистограммаОбъемная);
	Результат.Добавить(ГистограммаСНакоплением);
	Результат.Добавить(ГистограммаСНакоплениемГоризонтальная);
	Результат.Добавить(ГистограммаСНакоплениемГоризонтальнаяОбъемная);
	Результат.Добавить(ГистограммаСНакоплениемОбъемная);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
